package utils

import (
	"fmt"

	"github.com/fatih/color"
)

var (
	Blue = color.New(color.FgHiBlue, color.Bold).SprintFunc()
)

// PrintLogo 服务启动打印信息
func PrintLogo() {
	fmt.Println(Blue(`
	/$$   /$$           /$$                 /$$$$$$$$                 
	| $$  /$$/          | $$                | $$_____/                 
	| $$ /$$/  /$$   /$$| $$$$$$$   /$$$$$$ | $$     /$$$$$$  /$$   /$$
	| $$$$$/  | $$  | $$| $$__  $$ /$$__  $$| $$$$$ /$$__  $$|  $$ /$$/
	| $$  $$  | $$  | $$| $$  \ $$| $$$$$$$$| $$__/| $$  \ $$ \  $$$$/ 
	| $$\  $$ | $$  | $$| $$  | $$| $$_____/| $$   | $$  | $$  >$$  $$ 
	| $$ \  $$|  $$$$$$/| $$$$$$$/|  $$$$$$$| $$   |  $$$$$$/ /$$/\  $$
	|__/  \__/ \______/ |_______/  \_______/|__/    \______/ |__/  \__/   
`))
}

func Must(err error) {
	panic(err)
}